rosetta-source/src/main/resources/cdm-sample-files/dtcc-11-0/DDL_NewTrade4.xml

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
        xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/  ../../schemas/dtcc-11-0/soap-envelope.xsd"
        xmlns:fpml="http://www.fpml.org/2010/FpML-4-9"  xmlns:rm="OTC_RM_11-0"
        xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"  xmlns:mtc="OTC_Matching_11-0">
    <env:Header>
        <OTC_RM
            xmlns="OTC_RM_11-0">
            <Manifest>
                <TradeMsg>
                    <Activity>New</Activity>
                    <Status>Confirmed</Status>
                    <TransType>Trade</TransType>
                    <ProductType>CreditDefaultSwapShort</ProductType>
                    <Submitter>
                        <partyTradeIdentifier>
                            <fpml:partyReference href="DTCC00001234"/>
                            <fpml:tradeId tradeIdScheme="TradeRefNbr">15367807</fpml:tradeId>
                            <fpml:tradeId tradeIdScheme="MCPTransactionID">MSERV20181022.0006142001</fpml:tradeId>
                        </partyTradeIdentifier>
                    </Submitter>
                    <ContraTradeId>
                        <partyTradeIdentifier>
                            <fpml:partyReference href="DTCC00005678"/>
                            <fpml:tradeId tradeIdScheme="TradeRefNbr">CDV-3651370</fpml:tradeId>
                            <fpml:tradeId tradeIdScheme="MCPTransactionID">MSERV20181022.0006142001</fpml:tradeId>
                        </partyTradeIdentifier>
                    </ContraTradeId>
                    <USI>
                        <USIIssuer issuerIdScheme="http://www.fpml.org/coding-scheme/external/cftc/issuer-identifier">9J6AQFWC2C</USIIssuer>
                        <USITradeId tradeIdScheme="http://www.fpml.org/coding-scheme/external/unique-transaction-identifier">TRADESERV20181022206086611CVKAN4</USITradeId>
                    </USI>
                    <OriginatingUSI>
                        <USIIssuer issuerIdScheme="http://www.fpml.org/coding-scheme/external/cftc/issuer-identifier"/>
                        <USITradeId tradeIdScheme="http://www.fpml.org/coding-scheme/external/unique-transaction-identifier"/>
                    </OriginatingUSI>
                </TradeMsg>
                <MsgId>MSERV20181022.0006142001</MsgId>
            </Manifest>
            <Delivery>
                <RouteInfo>
                    <From>MarkitSERV</From>
                    <To>DTCC</To>
                </RouteInfo>
                <RouteHist>
                    <Route>
                        <RouteAddress>www.markitserv.net</RouteAddress>
                        <ReceiveTime>2018-10-22T10:05:42.260-04:00</ReceiveTime>
                        <ReleaseTime>2018-10-22T10:05:57.969-04:00</ReleaseTime>
                    </Route>
                </RouteHist>
            </Delivery>
        </OTC_RM>
    </env:Header>
    <env:Body>
        <OTC_Matching
            xmlns="OTC_Matching_11-0">
            <Activity>New</Activity>
            <Status>Confirmed</Status>
            <WarehouseState>
                <WarehouseStatus>Submit</WarehouseStatus>
                <WarehousePositionType>Gold</WarehousePositionType>
            </WarehouseState>
            <Trade>
                <FpML version="4-9" xmlns="http://www.fpml.org/2010/FpML-4-9"
                      xmlns:dsig="http://www.w3.org/2000/09/xmldsig#"
                      xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                      xsi:schemaLocation="http://www.fpml.org/2010/FpML-4-9 ../../schemas/fpml-4-9/fpml-main-4-9.xsd
					   http://www.w3.org/2000/09/xmldsig# ../../schemas/fpml-4-9/xmldsig-core-schema.xsd"
                      xsi:type="RequestTradeConfirmation">
                    <header>
                        <messageId messageIdScheme="perFpMLReqmt">MSERV20181022.0006142001</messageId>
                        <sentBy>DTCC00001234</sentBy>
                        <sendTo>DTCC00005678</sendTo>
                        <creationTimestamp>2018-10-22T14:05:57.974Z</creationTimestamp>
                    </header>
                    <trade>
                        <tradeHeader
                            xmlns="http://www.fpml.org/2010/FpML-4-9">
                            <partyTradeIdentifier>
                                <fpml:partyReference href="DTCC00001234"/>
                                <fpml:tradeId tradeIdScheme="TradeRefNbr">15367807</fpml:tradeId>
                                <fpml:tradeId tradeIdScheme="MCPTransactionID">MSERV20181022.0006142001</fpml:tradeId>
                            </partyTradeIdentifier>
                            <partyTradeIdentifier>
                                <fpml:partyReference href="DTCC00005678"/>
                                <fpml:tradeId tradeIdScheme="TradeRefNbr">CDV-3651370</fpml:tradeId>
                                <fpml:tradeId tradeIdScheme="MCPTransactionID">MSERV20181022.0006142001</fpml:tradeId>
                            </partyTradeIdentifier>
                            <tradeDate>2018-10-22</tradeDate>
                        </tradeHeader>
                        <creditDefaultSwap>
                            <generalTerms>
                                <effectiveDate>
                                    <fpml:unadjustedDate>2018-10-23</fpml:unadjustedDate>
                                    <fpml:dateAdjustments>
                                        <fpml:businessDayConvention>NotApplicable</fpml:businessDayConvention>
                                    </fpml:dateAdjustments>
                                </effectiveDate>
                                <scheduledTerminationDate>
                                    <fpml:adjustableDate>
                                        <fpml:unadjustedDate>2020-03-20</fpml:unadjustedDate>
                                        <fpml:dateAdjustments>
                                            <businessDayConvention>NotApplicable</businessDayConvention>
                                        </fpml:dateAdjustments>
                                    </fpml:adjustableDate>
                                </scheduledTerminationDate>
                                <sellerPartyReference href="DTCC00001234"/>
                                <buyerPartyReference href="DTCC00005678"/>
                                <referenceInformation>
                                    <fpml:referenceEntity>
                                        <fpml:entityName entityNameScheme="http://www.fpml.org/spec/2003/entity-name-RED">LEXMARK INTERNATIONAL, INC.</fpml:entityName>
                                        <fpml:entityId entityIdScheme="http://www.fpml.org/spec/2003/entity-id-RED">57BGE9AD0</fpml:entityId>
                                    </fpml:referenceEntity>
                                    <referenceObligation>
                                        <bond>
                                            <instrumentId instrumentIdScheme="http://www.fpml.org/spec/2002/instrument-id-ISIN">US529772AF23</instrumentId>
                                        </bond>
                                    </referenceObligation>
                                </referenceInformation>
                            </generalTerms>
                            <feeLeg>
                                <initialPayment>
                                    <payerPartyReference href="DTCC00001234"/>
                                    <receiverPartyReference href="DTCC00005678"/>
                                    <adjustablePaymentDate>2018-10-25</adjustablePaymentDate>
                                    <paymentAmount>
                                        <currency currencyScheme="http://www.fpml.org/ext/iso4217">USD</currency>
                                        <amount>2345.00000</amount>
                                    </paymentAmount>
                                </initialPayment>
                                <periodicPayment>
                                    <paymentFrequency>
                                        <periodMultiplier>3</periodMultiplier>
                                        <period>M</period>
                                    </paymentFrequency>
                                    <firstPeriodStartDate>2018-09-20</firstPeriodStartDate>
                                    <firstPaymentDate>2018-12-20</firstPaymentDate>
                                    <rollConvention>20</rollConvention>
                                    <fixedAmountCalculation>
                                        <fixedRate>0.0100000000</fixedRate>
                                    </fixedAmountCalculation>
                                </periodicPayment>
                            </feeLeg>
                            <protectionTerms>
                                <calculationAmount id="calculationAmount">
                                    <currency currencyScheme="http://www.fpml.org/ext/iso4217">USD</currency>
                                    <amount>100000000.00000</amount>
                                </calculationAmount>
                            </protectionTerms>
                        </creditDefaultSwap>
                        <calculationAgent>
                            <calculationAgentPartyReference href="DTCC00001234"/>
                        </calculationAgent>
                        <calculationAgentBusinessCenter businessCenterScheme="http://www.fpml.org/spec/2000/business-center">USNY</calculationAgentBusinessCenter>
                        <documentation>
                            <masterAgreement>
                                <masterAgreementType masterAgreementTypeScheme="http://dtcc.com/coding-scheme/master-agreement-type">ISDA</masterAgreementType>
                                <masterAgreementVersion masterAgreementVersionScheme="http://www.fpml.org/coding-scheme/master-agreement-version">1992</masterAgreementVersion>
                                <masterAgreementDate>1999-04-07</masterAgreementDate>
                            </masterAgreement>
                            <contractualDefinitions contractualDefinitionsScheme="http://www.fpml.org/coding-scheme/contractual-definitions">ISDA2014Credit</contractualDefinitions>
                            <contractualMatrix>
                                <matrixType matrixTypeScheme="http://www.fpml.org/coding-scheme/matrix-type">CreditDerivativesPhysicalSettlementMatrix</matrixType>
                                <matrixTerm matrixTermScheme="http://www.fpml.org/coding-scheme/credit-matrix-transaction-type">StandardNorthAmericanCorporate</matrixTerm>
                            </contractualMatrix>
                        </documentation>
                    </trade>
                    <party id="DTCC00001234">
                        <fpml:partyId partyIdScheme="DTCC">DTCC00001234</fpml:partyId>
                        <fpml:partyId partyIdScheme="http://www.fpml.org/coding-scheme/external/iso17442">DTCCG5GSEF7VJP5I7OUK5573</fpml:partyId>
                    </party>
                    <party id="DTCC00005678">
                        <fpml:partyId partyIdScheme="DTCC">DTCC00005678</fpml:partyId>
                        <fpml:partyId partyIdScheme="http://www.fpml.org/coding-scheme/external/iso17442">DTCCO2RNE8IBXP4R0TD8PU41</fpml:partyId>
                    </party>
                </FpML>
            </Trade>
            <WorkflowData>
                <partyReference href="DTCC00001234"/>
                <PartyWorkflowFields>
                    <superId>S6140087.3.SE11161006.3</superId>
                    <deskId>S Kathpalia</deskId>
                </PartyWorkflowFields>
            </WorkflowData>
            <WorkflowData>
                <partyReference href="DTCC00005678"/>
                <PartyWorkflowFields>
                    <comment>SUBFOLDER_ID</comment>
                </PartyWorkflowFields>
            </WorkflowData>
            <ReportingData>
                <ReportingHeader>
                    <ReportingJurisdiction>
                        <UTI>
                            <UTIIssuer issuerIdScheme="http://www.fpml.org/coding-scheme/external/issuer-identifier">9J6AQFWC2C</UTIIssuer>
                            <UTITradeId tradeIdScheme="http://www.fpml.org/coding-scheme/external/unique-transaction-identifier">TRADESERV2018102221714656009C39J</UTITradeId>
                        </UTI>
                    </ReportingJurisdiction>
                </ReportingHeader>
            </ReportingData>
        </OTC_Matching>
    </env:Body>
</env:Envelope>